assignment1/assignment1.tex
% Created 2016-09-24 Sat 16:18
\documentclass[11pt,a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\bibliographystyle{plain}
\usepackage{microtype}
\usepackage{tikz}
\usepackage{circuitikz}
\usetikzlibrary{tikzmark,decorations.pathmorphing}
\author{Sasja LASTNAME?, Martin LASTNMAME?, Martijn Terpstra}
\date{\today}
\title{Title}
\hypersetup{
 pdfauthor={Sasja LASTNAME?, Martin LASTNMAME?, Martijn Terpstra},
 pdftitle={Title},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 8.2.10)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

%% Ik heb dit document in Emacs met org-mode gemaakt en het vervolgens
%% naar latex geexporteerd. Het orginele bestand is het bestand met de
%% .org extensie.

%% Ikzelf vind org-mode bestanden makkelijkere te lezen maar als dit voor
%% jullie lastig is, is het waarschijnlijk makkelijker om alles gelijk in
%% LateX te scrijven.

%% Martijn

\section{Tasks}
\label{sec:orgheadline9}
\subsection{Write requirements}
\label{sec:orgheadline1}
\subsection{Design test cases}
\label{sec:orgheadline6}
\subsubsection{Functions assignments}
\label{sec:orgheadline2}
\subsubsection{Variable assignments}
\label{sec:orgheadline3}
\subsubsection{Equality tests}
\label{sec:orgheadline4}
\subsubsection{Expression aprsing}
\label{sec:orgheadline5}
\subsection{Assign Test cases}
\label{sec:orgheadline7}
\subsection{Execute test cases (automation?)}
\label{sec:orgheadline8}
\section{Short requirements}
\label{sec:orgheadline10}
\begin{quote}
From this description we can deduce that a test approach must at least describe:
\begin{itemize}
\item the product that will be tested,
\item the controlled environment in which it will be tested,
\item the specified procedure following which it will be tested,
\item the quality characteristics that will be tested, and
\item the specification.
\end{itemize}
\end{quote}

\section{Template}
\label{sec:orgheadline25}
\subsection{Introduction}
\label{sec:orgheadline11}
State the objectives and overview of the document at a high-level.
\subsection{Test Goal}
\label{sec:orgheadline12}
What is the overall goal of the testing effort, what are the final deliverables, who are the
stakeholders, i.e., for whom are you doing it, applicable laws and (international) standards.
\subsection{The Product}
\label{sec:orgheadline13}
Identification of the SUT: What is the product (SUT – System Under Test) being tested, its
version, its operation context, required platform, its interfaces, and how is it executed.
\subsection{The Specification}
\label{sec:orgheadline14}
What is the test basis, i.e., its specification, and all documentation describing what the SUT
shall do. (Do not include specification documents, but refer to them.)
\subsection{Risks}
\label{sec:orgheadline15}
What are the risks of the product (at a high level), of the development process, and of the
test process. How are risks handled and mitigated.
\subsection{Test Environment}
\label{sec:orgheadline16}
What is the (controlled) environment in which experiments are performed, what is the test
architecture, i.e., how are SUT and test system positioned and connected, which environment
and infrastructure (hardware, software, middleware, databases, libraries, . . .) are required for
testing, how to access the SUT and its interfaces, which stubs and drivers are needed, are
tests performed in a laboratory, production, or user environment.
\subsection{Quality Characteristics}
\label{sec:orgheadline17}
Which quality characteristics are tested (IS 9126 or other quality model: functionality, reli-
ability, usability, . . .),
\subsection{Levels and Types of Testing}
\label{sec:orgheadline18}
Which levels and types of tests are performed: (V-model: unit, integration, module, sys-
tem, acceptance, . . .), which units, components, subsystems, . . . are tested and for what,
accessibility (white/black box), verification vs. validation tests, . . ..
\subsection{Who will do the Testing}
\label{sec:orgheadline19}
Who tests what, and what are the roles: developer, (independent) tester, user, alpha, certi-
fication, . . .),
\subsection{Test Generation Techniques}
\label{sec:orgheadline20}
As far as already known or required, e.g., by applicable standards: black-box (equivalence
partitioning, boundary value analysis, error guessing, cause-effect graphing, decision tables,
state transitions, use case testing, exploratory testing, . . .), white-box (path, statement,
(multiple) condition, decision/branch, function, call, loop, MC/DC coverage, . . .), mutation
testing, combinatorial testing, . . ..
\subsection{Test Automation}
\label{sec:orgheadline21}
As far as applicable, which parts of the testing will be automated, which test tools will be
used in the various phases of the testing process (planning, preparation, test generation, test
execution, completion), which tests are performed manually, what is automated, and which
tools have to be obtained or developed.
\subsection{Exit Criteria}
\label{sec:orgheadline22}
What are the criteria for going from one test phase to the next, when is testing finished,
when is the product considered sufficiently tested, what are the (final) evaluation criteria.
\subsection{Testware}
\label{sec:orgheadline23}
Which test products are recorded, consolidated, and kept for reuse.
\subsection{Issue Registration}
\label{sec:orgheadline24}
How are issues (defects) registered, analysed, reported, and handled.

\section{Observations martijn}
\label{sec:orgheadline30}
\subsection{Overall}
\label{sec:orgheadline26}
\begin{itemize}
\item Comments only in util/BigFunctions.java
\end{itemize}
\subsection{Expression that crash}
\label{sec:orgheadline27}
should the program CRASH on wrong input?
\begin{itemize}
\item \(1/0\)
\item \(log(-1)\)
\item \(\phi = 7\)
\item Using TABS in any expression
\item using arrow keys
\end{itemize}

The program crashes on some but not all wrong input.
\begin{itemize}
\item \(seven + eight\) does not crash.
\end{itemize}
\subsection{Expression with a wrong result}
\label{sec:orgheadline28}
\begin{itemize}
\item \((1 / 300) * 300 = 0.9999999999999900\). should be \(1\)
\item \(2^(-1) = 0\). should be \(0.5\)
\item \(log( 10 ^ 1234)\) outputs an intermediate result, then crashes. should output \(1234\)
\item \(0^0\) return \(1\), is undefined
\end{itemize}

\subsection{Other}
\label{sec:orgheadline29}
\begin{itemize}
\item Input reading is primitive, cant go back without deleting.
\item \(ln(log( 10^e ))\) throws an error Could not convert bigInteger into long, but still gives the correct answer
\item \(1 Banana \phi = 1\)
\item Control + $\backslash$ gives a lot of debugging information
\item \(x=7\)
      \(7(x)\) gives \(7\), not \(49\)
\item \(f(x):=7\), works fine
\(f(x):=f(x)+1\), work if the function f has previously been defined
\(f(1)\) crashed due to an infinite loop
\item Using 9999 character variable names gives an exception, 999 characters is fine.
\item \(x(z):=z\)
      \(f(x):=x()\)
      \(f(7)\)
      crashes
\item \(f(x):=1\)
      \(f(x):=f(2)\)
      \(f(3)\), crashes, expected \(1\)
\item Equality?, can either return -1,0, or 1
\item \(z=7 \ne 7=z\)
\end{itemize}
\end{document}
